<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"59cfad0f113dfff0cd6471ba725f462716ec945e9e92d3f0d58d10f2d4abb7f3","plan_job_ref":"Job TF Plan #9 at https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729571705","plan_hash":"b466fcc826082606d6e6fdc3d1364bb99a2758dec33e87b6983a4c219809a72f","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __secure-linux-jump__
With backend config: `resource_group_name=ampe-state-sandbox-resourcegroup-nwqlx-rg
storage_account_name=ampestatesandboxsadojob
container_name=ampe-state-sandbox-sc-ndkad-stct
key=slj.terraform.tfstate`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.azbas will be created
  + resource "azurerm_bastion_host" "azbas" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "AMPE-dev-linux-vm-azure-bastion-pgyul-bast"
      + resource_group_name    = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = "*****************************************************************************************************************************************************************************************"
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_subnet.snet1a will be created
  + resource "azurerm_subnet" "snet1a" {
      + address_prefixes                               = [
          + "10.0.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AMPE-dev-linux-vm-subnet1a-mrasf-snet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "AMPE-dev-linux-vm-resourcegroup-bmcjn-rg"
      + virtual_network_name                           = "AMPE-dev-linux-vm-virtualnet1-fltei-vnet"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #9](https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4729571705)